; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob37) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate9)
	(at pallet2 distributor1)
	(clear crate8)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 363)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 275)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 92)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 17)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 82)
	(at crate3 depot0)
	(on crate3 crate0)
	(= (weight crate3) 19)
	(at crate4 distributor0)
	(on crate4 crate1)
	(= (weight crate4) 76)
	(at crate5 distributor1)
	(on crate5 crate2)
	(= (weight crate5) 88)
	(at crate6 depot0)
	(on crate6 crate3)
	(= (weight crate6) 100)
	(at crate7 depot0)
	(on crate7 crate6)
	(= (weight crate7) 68)
	(at crate8 distributor1)
	(on crate8 crate5)
	(= (weight crate8) 81)
	(at crate9 distributor0)
	(on crate9 crate4)
	(= (weight crate9) 72)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate2 crate7)
		(on crate3 pallet1)
		(on crate4 pallet2)
		(on crate5 crate3)
		(on crate7 crate0)
		(on crate8 crate4)
		(on crate9 crate8)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist1 crate9 crate4 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate4)
   added: (lifting hoist1 crate9) (clear crate4)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 8
2. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 72
   goals met: 1 of 8
3. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 1 to 11
   goals met: 1 of 8
4. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 72 to 0
   goals met: 1 of 8
5. (lift hoist1 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate1)
   added: (lifting hoist1 crate4) (clear crate1)
   changed: (fuel-cost) from 11 to 12
   goals met: 1 of 8
6. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 8
7. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 76
   goals met: 1 of 8
8. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 22 to 32
   goals met: 1 of 8
9. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 72
   goals met: 1 of 8
10. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 76 to 0
   goals met: 1 of 8
11. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 32 to 42
   goals met: 1 of 8
12. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 42 to 43
   goals met: 1 of 8
13. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 17
   goals met: 1 of 8
14. (lift hoist0 crate7 crate6 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate6)
   added: (lifting hoist0 crate7) (clear crate6)
   changed: (fuel-cost) from 43 to 44
   goals met: 1 of 8
15. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 44 to 54
   goals met: 1 of 8
16. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 17 to 85
   goals met: 1 of 8
17. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 54 to 64
   goals met: 1 of 8
18. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 64 to 74
   goals met: 1 of 8
19. (lift hoist0 crate6 crate3 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate3)
   added: (lifting hoist0 crate6) (clear crate3)
   changed: (fuel-cost) from 74 to 75
   goals met: 1 of 8
20. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 85 to 185
   goals met: 1 of 8
21. (lift hoist0 crate3 crate0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate0)
   added: (lifting hoist0 crate3) (clear crate0)
   changed: (fuel-cost) from 75 to 76
   goals met: 1 of 8
22. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 185 to 204
   goals met: 1 of 8
23. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 76 to 86
   goals met: 1 of 8
24. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 72 to 148
   goals met: 1 of 8
25. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 148 to 76
   goals met: 1 of 8
26. (drop hoist2 crate9 crate8 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate8)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate8)
   goals met: 2 of 8
27. (lift hoist2 crate9 crate8 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist2) (on crate9 crate8)
   added: (lifting hoist2 crate9) (clear crate8)
   changed: (fuel-cost) from 86 to 87
   goals met: 1 of 8
28. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 76 to 148
   goals met: 1 of 8
29. (lift hoist2 crate8 crate5 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate5)
   added: (lifting hoist2 crate8) (clear crate5)
   changed: (fuel-cost) from 87 to 88
   goals met: 1 of 8
30. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 148 to 229
   goals met: 1 of 8
31. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   changed: (fuel-cost) from 88 to 89
   goals met: 1 of 8
32. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   changed: (current_load truck0) from 204 to 292
   goals met: 1 of 8
33. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 89 to 99
   goals met: 1 of 8
34. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 292 to 273
   goals met: 1 of 8
35. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 99 to 109
   goals met: 1 of 8
36. (drop hoist1 crate3 pallet1 distributor0)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 pallet1)
   goals met: 2 of 8
37. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 109 to 119
   goals met: 2 of 8
38. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 273 to 185
   goals met: 2 of 8
39. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 119 to 129
   goals met: 2 of 8
40. (drop hoist1 crate5 crate3 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate3)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate3)
   goals met: 3 of 8
41. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 229 to 153
   goals met: 3 of 8
42. (drop hoist2 crate4 crate2 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate2)
   goals met: 3 of 8
43. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 153 to 72
   goals met: 3 of 8
44. (drop hoist2 crate8 crate4 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate4)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate4)
   goals met: 4 of 8
45. (lift hoist2 crate8 crate4 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate4)
   added: (lifting hoist2 crate8) (clear crate4)
   changed: (fuel-cost) from 129 to 130
   goals met: 3 of 8
46. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 72 to 153
   goals met: 3 of 8
47. (lift hoist2 crate4 crate2 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate2)
   added: (lifting hoist2 crate4) (clear crate2)
   changed: (fuel-cost) from 130 to 131
   goals met: 3 of 8
48. (load hoist2 crate4 truck1 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck1) (available hoist2)
   changed: (current_load truck1) from 153 to 229
   goals met: 3 of 8
49. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 131 to 132
   goals met: 3 of 8
50. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 185 to 267
   goals met: 3 of 8
51. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 132 to 142
   goals met: 3 of 8
52. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 267 to 199
   goals met: 3 of 8
53. (drop hoist0 crate7 crate0 depot0)
   deleted: (lifting hoist0 crate7) (clear crate0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate0)
   goals met: 4 of 8
54. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 199 to 117
   goals met: 4 of 8
55. (drop hoist0 crate2 crate7 depot0)
   deleted: (lifting hoist0 crate2) (clear crate7)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate7)
   goals met: 5 of 8
56. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 229 to 153
   goals met: 5 of 8
57. (drop hoist2 crate4 pallet2 distributor1)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 pallet2)
   goals met: 6 of 8
58. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 153 to 72
   goals met: 6 of 8
59. (drop hoist2 crate8 crate4 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate4)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate4)
   goals met: 7 of 8
60. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 72 to 0
   goals met: 7 of 8
61. (drop hoist2 crate9 crate8 distributor1)
   deleted: (lifting hoist2 crate9) (clear crate8)
   added: (available hoist2) (at crate9 distributor1) (clear crate9) (on crate9 crate8)
   goals met: 8 of 8
